using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Гороскоп
{
    class DataBase
    {
        public static string ZnakZodiaka="";
        public static string Predskazanie1Segodnia= "Вас ждет насыщенный день. Звезды не скупятся на приятные сюрпризы, вероятность перемен к лучшему высока. Действуйте решительно, " +
            "не бойтесь проявлять инициативу – это уместно во всех сферах жизни. Можно о многом поговорить с близкими, поделиться планами на будущее, " +
            "обсудить идеи, появившиеся у вас в последнее время.";
        public static string Predskazanie2Segodnia = "Будьте осторожны в делах, старайтесь не принимать поспешных решений и не рисковать. " +
            "Стоит прислушаться к советам старых знакомых, воспользоваться чужим опытом; так вы не допустите собственных ошибок и " +
            "быстрее добьетесь цели. Возможны хорошие новости, касающиеся работы или учебы.";
        public static string Predskazanie3Segodnia = "Непростой день. Чтобы добиться успехов, приходится потрудиться. Возможны рабочие конфликты," +
            " разногласия с единомышленниками. Споры отнимают много времени, " +
            "мешают сосредоточиться на делах, но вы все же не забываете о том, что действительно важно.";
        public static string Predskazanie4Segodnia = "Благоприятный день, хорошо подходящий для работы и учебы, а также для делового общения. Будет возможность пообщаться с людьми, " +
            "по которым вы в последнее время скучали, восстановить какие-то старые связи. Чужие идеи окажутся " +
            "очень полезными тем, кто в последнее время несколько растерялся, не знал, куда двигаться дальше.";
        public static string Predskazanie5Segodnia = "День обещает приятные сюрпризы. Если вы проявите настойчивость, то решите несколько важных проблем, найдете способ заметно облегчить жизни и себе," +
            " и своим близким. Вероятно интересное и полезное общение с людьми, приехавшими издалека. Даже случайные знакомства могут иметь очень приятное продолжение. " +
            "Ваш искренний интерес к окружающим идет на пользу отношениям.";
        public static string Predskazanie6Segodnia = "День подходит для того, чтобы взяться за дела, к которым раньше не решались приступить. Они окажутся гораздо проще, чем можно было ожидать." +
            " Пригодится опыт, полученный раньше, и не только собственный. Не стесняйтесь обращаться за советами к разным людям, анализировать их рекомендации и выбирать лучшую из них.";
        public static string Predskazanie7Segodnia = "Появляются неплохие идеи, но едва ли их удастся реализовать сразу. Стоит запастись терпением, особенно если дело касается финансовых и имущественных вопросов." +
            " Не бойтесь отойти от обычного ритма жизни: это будет очень полезно. Иногда приходится менять планы. Поначалу это не радует, но позже становится ясно, что все сложилось не так уж плохо.";
        public static string Predskazanie8Segodnia = "Что бы ни происходило, вы сохраняете спокойствие. Это позволяет решить собственные проблемы и помочь тем, кто оказался в сложной ситуации, растерялся и потерял голову. " +
            "Можно заниматься делами, требующими аккуратности, сосредоточенности, внимания к деталям." +
            " Вы не отвлекаетесь по пустякам, почти не ошибаетесь, а если все же совершаете какие-то промахи, то все удается вовремя исправить.";
        public static string Predskazanie9Segodnia = "Будет шанс завязать интересные знакомства, однако стоит проявить разборчивость. Сегодня вами интересуются не только достойные люди, но и сомнительные личности. " +
            "Не торопитесь раскрывать свои секреты, говорить о сокровенном. Скорее всего, интуиция подскажет, кому стоит доверять, а вот советы окажутся бесполезными.";
        public static string Predskazanie10Segodnia = "День требует серьезного и ответственного отношения к любым делам. Не идите на поводу у эмоций, не принимайте важных решений под влиянием момента." +
            " Стоит прислушаться к советам старых знакомых, надежных союзников: возможно, они знают то, что вам пока неизвестно. " +
            "Не относитесь легкомысленно даже к мелким делам, тогда день и неприятностей не принесет.";
        public static string Predskazanie1Year = "Ожидать от этого года многого будет ошибкой. Двойной ошибкой будет рассчитывать на то, что успехи придут легко." +
            " Куда вероятнее другое – что вам придется бороться и с обстоятельствами, и с сильными противниками, чтобы достичь нужных результатов." +
            " При этом в течение года будет несколько благоприятных моментов, когда можно получить желаемое очень быстро и почти без усилий; если вам удастся поймать эту волну и вовремя начать действовать, многое сложится куда проще.";
        public static string Predskazanie2Year = "Вас ждет хороший год. Особенно благоприятной и безоблачной обещает быть первая его половина. Правда, многое будет зависеть от того, как вы проведете начало января. " +
            "Важно не терять здравомыслия в это время, не совершать необдуманных поступков. Если вы все же допустите ошибки, позже вас ждет несколько неприятных и напряженных недель. " +
            "С другой стороны, именно они дадут возможность получить опыт, который пригодится позже.";
        public static string Predskazanie3Year = "Год начинается очень противоречиво и неровно. Январские события заставят вас подумать о том, верный ли путь вы выбрали, не ошиблись ли в людях, которых привыкли считать близкими по духу." +
            " Часто раздражают мелочи." +
            " Вы становитесь вспыльчивыми, часто позволяете себе резкие замечания, не задумываясь о том, что они кого-то могут обидеть. " +
            "Февраль мало чем будет лучше – вас ждут испытания, трудности, многочисленные споры и выяснение отношений.";
        public static string Predskazanie4Year = "Благоприятный день, хорошо подходящий для работы и учебы, а также для делового общения. Будет возможность пообщаться с людьми, по которым вы в последнее время скучали, восстановить какие-то старые связи." +
            " Чужие идеи окажутся очень полезными тем, кто в последнее время несколько растерялся, не знал, куда двигаться дальше.";
        public static string Predskazanie5Year = "Год будет противоречивым и неоднозначным – вам понравится. Люди часто оказываются не теми, кем кажутся, события то и дело приобретают неожиданный оборот, приходится постоянно изобретать и выдумывать нечто новое." +
            " Вряд ли кто-то, кроме вас, чувствовал бы себя в таких обстоятельствах как рыба в воде. А вы ничего, справляетесь.";
        public static string Predskazanie6Year = "Год начинается хорошо, в первые его месяцы звезды определенно будут к вам благосклонны. Стоит иметь в виду, что инициативу желательно проявлять уже в январе. " +
            "Возможно, вам придется подталкивать других к решительным действиям – или вдохновлять на то, на что они прежде не решались. В обоих случаях имейте в виду: стараться вы будете не зря. " +
            "Возможно, именно в это время у вас появятся единомышленники, вместе с которыми вы будете воплощать в жизнь свои самые смелые планы. ";
        public static string Predskazanie7Year = "Начало года благоприятно. Первые месяцы 2020 дают возможность сделать то, что не получалось раньше, исправить какие-то старые ошибки." +
            " Не исключен значительный прорыв в деле, которое все, кроме вас, считали почти безнадежным. " +
            "В это время хорошо принимать какие-то решения, касающиеся будущего – это касается и профессиональной сферы, и сугубо личных вопросов. ";
    }
}
